{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.5.0", "userDefinedMetadata": {"signature": {"inputs": {"x:0": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "272"}, {"size": "192"}, {"size": "6"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "34"}, {"size": "24"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "6"}, {"size": "4"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "4"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "272"}, {"size": "192"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Conv2D", "op": "Conv2D", "input": ["x", "unknown"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Conv2D", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "4", "4", "1"]}}, "ksize": {"list": {"i": ["1", "4", "4", "1"]}}}}, {"name": "StatefulPartitionedCall/Conv2D_1", "op": "Conv2D", "input": ["StatefulPartitionedCall/MaxPool", "unknown_1"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Conv2D_3", "op": "Conv2D", "input": ["StatefulPartitionedCall/AvgPool", "unknown_5"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/Conv2D_1", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/add_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/MaxPool_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Conv2D_2", "op": "Conv2D", "input": ["StatefulPartitionedCall/Relu_1", "unknown_3"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/Conv2D_2", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Relu_2", "op": "Relu", "input": ["StatefulPartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/Relu_2", "StatefulPartitionedCall/Conv2D_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/MaxPool_2", "op": "MaxPool", "input": ["StatefulPartitionedCall/add_3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/AvgPool_1", "op": "AvgPool", "input": ["StatefulPartitionedCall/add_3"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Conv2D_4", "op": "Conv2D", "input": ["StatefulPartitionedCall/MaxPool_2", "unknown_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/Conv2D_6", "op": "Conv2D", "input": ["StatefulPartitionedCall/AvgPool_1", "unknown_10"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/Conv2D_4", "unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Relu_3", "op": "Relu", "input": ["StatefulPartitionedCall/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Conv2D_5", "op": "Conv2D", "input": ["StatefulPartitionedCall/Relu_3", "unknown_8"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/Conv2D_5", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Relu_4", "op": "Relu", "input": ["StatefulPartitionedCall/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/output", "op": "Add", "input": ["StatefulPartitionedCall/Relu_4", "StatefulPartitionedCall/Conv2D_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/output"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_6", "shape": [7, 7, 16, 32], "dtype": "float32"}, {"name": "unknown_7", "shape": [32], "dtype": "float32"}, {"name": "unknown_8", "shape": [7, 7, 32, 1], "dtype": "float32"}, {"name": "unknown_9", "shape": [1], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 4, 4], "dtype": "float32"}, {"name": "unknown_2", "shape": [4], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 4, 16], "dtype": "float32"}, {"name": "unknown_4", "shape": [16], "dtype": "float32"}, {"name": "unknown", "shape": [3, 3, 6, 4], "dtype": "float32"}, {"name": "unknown_0", "shape": [4], "dtype": "float32"}, {"name": "unknown_5", "shape": [1, 1, 4, 16], "dtype": "float32"}, {"name": "unknown_10", "shape": [1, 1, 16, 1], "dtype": "float32"}]}]}